In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame([
    ['20180901', 'A', 10],
    ['20180901', 'B', 100],
    ['20180901', 'C', 1000],
    ['20180902', 'A', 20],
    ['20180902', 'B', 200],
    ['20180902', 'C', 2000],
    ['20180903', 'A', 30],
    ['20180903', 'B', 300],
    ['20180903', 'C', 3000],
], columns=['date', 'typecode', 'volume'])

In [4]:
df

       date typecode  volume
0  20180901        A      10
1  20180901        B     100
2  20180901        C    1000
3  20180902        A      20
4  20180902        B     200
5  20180902        C    2000
6  20180903        A      30
7  20180903        B     300
8  20180903        C    3000

In [5]:
df_pivoted1 = df.pivot(index='date', columns='typecode', values='volume')
df_pivoted1

typecode   A    B     C
date
20180901  10  100  1000
20180902  20  200  2000
20180903  30  300  3000

In [6]:
df_pivoted1.columns

Index(['A', 'B', 'C'], dtype='object', name='typecode')

In [7]:
df_pivoted1.index

Index(['20180901', '20180902', '20180903'], dtype='object', name='date')

In [9]:
df_pivoted2 = df_pivoted1.copy()
df_pivoted2.columns = df_pivoted2.columns.values
df_pivoted2.reset_index(level=0, inplace=True)
df_pivoted2

       date   A    B     C
0  20180901  10  100  1000
1  20180902  20  200  2000
2  20180903  30  300  3000

# stack

In [10]:
df2 = df_pivoted2.copy()
df2

       date   A    B     C
0  20180901  10  100  1000
1  20180902  20  200  2000
2  20180903  30  300  3000

In [32]:
df3 = df2.set_index('date').copy()
df3

           A    B     C
date
20180901  10  100  1000
20180902  20  200  2000
20180903  30  300  3000

In [42]:
df4 = df3.stack(level=-1).copy()
df4

date
20180901  A      10
          B     100
          C    1000
20180902  A      20
          B     200
          C    2000
20180903  A      30
          B     300
          C    3000
dtype: int64

In [43]:
df4 = df4.reset_index().copy()
df4

       date level_1     0
0  20180901       A    10
1  20180901       B   100
2  20180901       C  1000
3  20180902       A    20
4  20180902       B   200
5  20180902       C  2000
6  20180903       A    30
7  20180903       B   300
8  20180903       C  3000

In [45]:
df4.rename(columns={"level_1": "division", 0: "val"}, inplace=True)
df4

       date division   val
0  20180901        A    10
1  20180901        B   100
2  20180901        C  1000
3  20180902        A    20
4  20180902        B   200
5  20180902        C  2000
6  20180903        A    30
7  20180903        B   300
8  20180903        C  3000